; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v3 - type_1 ?v7 - type_2)
 	      (pred_1 ?v8 - object ?v7 - type_2)
	      (pred_4 ?v3 - type_1 ?v5 - type_3)
	      (pred_3 ?v3 - type_1 ?v8 - object ?v5 - type_3))

   (:action op_3
       :parameters  (?v3 - type_1 ?v2 ?v6 - type_2)
       :precondition (and  (pred_2 ?v3 ?v2))
       :effect (and  (pred_2 ?v3 ?v6)
		     (not (pred_2 ?v3 ?v2))))

   (:action op_1
       :parameters (?v3 - type_1 ?v1 - object ?v4 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v1 ?v4) (pred_2 ?v3 ?v4) (pred_4 ?v3 ?v5))
       :effect (and (pred_3 ?v3 ?v1 ?v5)
		    (not (pred_1 ?v1 ?v4)) 
		    (not (pred_4 ?v3 ?v5))))

   (:action op_2
       :parameters (?v3 - type_1 ?v1 - object ?v4 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v1 ?v5) (pred_2 ?v3 ?v4))
       :effect (and (pred_1 ?v1 ?v4)
		    (pred_4 ?v3 ?v5)
		    (not (pred_3 ?v3 ?v1 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_05 - type_1
obj_04 obj_02 - type_3
obj_06 obj_09 obj_01 - type_2
obj_03 obj_07 obj_08 - object)
(:init
(pred_2 obj_05 obj_09)
(pred_4 obj_05 obj_04)
(pred_4 obj_05 obj_02)
(pred_1 obj_03 obj_06)
(pred_1 obj_07 obj_09)
(pred_1 obj_08 obj_09)
)
(:goal
(and
(pred_1 obj_03 obj_09)
(pred_1 obj_07 obj_06)
(pred_1 obj_08 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_05 ?b obj_02))))
)
)

; plan
1. (op_1 obj_05 obj_07 obj_09 obj_04)
   deleted: (pred_1 obj_07 obj_09) (pred_4 obj_05 obj_04)
   added: (pred_3 obj_05 obj_07 obj_04)
   goals met: 0 of 3
2. (op_3 obj_05 obj_09 obj_06)
   deleted: (pred_2 obj_05 obj_09)
   added: (pred_2 obj_05 obj_06)
   goals met: 0 of 3
3. (op_2 obj_05 obj_07 obj_06 obj_04)
   deleted: (pred_3 obj_05 obj_07 obj_04)
   added: (pred_1 obj_07 obj_06) (pred_4 obj_05 obj_04)
   goals met: 1 of 3
4. (op_1 obj_05 obj_03 obj_06 obj_04)
   deleted: (pred_1 obj_03 obj_06) (pred_4 obj_05 obj_04)
   added: (pred_3 obj_05 obj_03 obj_04)
   goals met: 1 of 3
5. (op_3 obj_05 obj_06 obj_09)
   deleted: (pred_2 obj_05 obj_06)
   added: (pred_2 obj_05 obj_09)
   goals met: 1 of 3
6. (op_2 obj_05 obj_03 obj_09 obj_04)
   deleted: (pred_3 obj_05 obj_03 obj_04)
   added: (pred_1 obj_03 obj_09) (pred_4 obj_05 obj_04)
   goals met: 2 of 3
7. (op_1 obj_05 obj_08 obj_09 obj_04)
   deleted: (pred_1 obj_08 obj_09) (pred_4 obj_05 obj_04)
   added: (pred_3 obj_05 obj_08 obj_04)
   goals met: 2 of 3
8. (op_3 obj_05 obj_09 obj_01)
   deleted: (pred_2 obj_05 obj_09)
   added: (pred_2 obj_05 obj_01)
   goals met: 2 of 3
9. (op_2 obj_05 obj_08 obj_01 obj_04)
   deleted: (pred_3 obj_05 obj_08 obj_04)
   added: (pred_1 obj_08 obj_01) (pred_4 obj_05 obj_04)
   goals met: 3 of 3
